app/views/cocktails/show.html.erb

        <h2 id="titleing">Ingredients</h2>
      <% @cocktail.doses.each do |dose| %>
---
SELECT "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 6]]