app/controllers/cocktails_controller.rb

  def show
    @cocktail = Cocktail.find(params[:id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @cocktail = Cocktail.new(cocktail_params)
    @cocktail.save
---
INSERT INTO "cocktails" ("name", "created_at", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "caipi"], ["created_at", "2020-02-20 16:42:53.895091"], ["updated_at", "2020-02-20 16:42:53.895091"], ["url", ""]]

  def destroy
    cocktail = Cocktail.find(params[:id])
    cocktail.destroy
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
DELETE FROM "cocktails" WHERE "cocktails"."id" = $1  [["id", 19]]